Revit 2026 API
DocumentReloadedLatestEventArgs.Location Property
 Full path of the central model which is to be operated.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public string Location { get; set; }
Public Property Location As String
	Get
	Set
public:
property String^ Location {
	String^ get ();
	void set (String^ value);
}
member Location : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 For C4R model, it looks like 'Autodesk Docs://My project/my model.rvt'.
See Also
Reference
DocumentReloadedLatestEventArgs Class
Autodesk.Revit.DB.Events Namespace